[{"_id":{"$oid":"61cc3a8a7c886c96e5c6ca5d"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated an manipulative cannibal killer.","Genre":{"Name":"Thriller","Desription":"Thriller film, also known as supense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"MovieDescription":"Updated description: A young FBI cadet must receive the help of an incarcerated an manipulative cannibal killer."},
{"_id":{"$oid":"61ccb5942b463cd4e2ba5184"},"Title":"Edward Scissorhands","Genre":{"Name":"Fantasy","Description":"A fantasy story is about magic or supernatural forces."},"Director":{"Name":"Tim Burton","Birth":"1958"},"Featured":true,"MovieDescription":"In a castle high on top of a hill lives an inventor''s greatest creation - Edward, a near-complete person. The creator died before he could finish Edward''s hands; instead, he is left with metal scissors for hands. Since then, he has lived alone, until a kind lady called Peg discovers him and welcomes him into her home. At first, everyone welcomes him into the community, but soon things begin to take a change for the worse."},
{"_id":{"$oid":"61ccb6202b463cd4e2ba5185"},"Title":"Beetlejuice","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Tim Burton","Birth":"1958"},"Featured":true,"MovieDescription":"Beetlejuice is a 1988 American fantasy comedy film directed by Tim Burton, produced by The Geffen Company, and distributed by Warner Bros. Pictures. The plot revolves around a recently deceased couple (Alec Baldwin and Geena Davis) who become ghosts haunting their former home, and an obnoxious, devious poltergeist named Betelgeuse (pronounced and occasionally spelled Beetlejuice in the film and portrayed by Michael Keaton) from the Netherworld who tries to scare away the new inhabitants (Catherine O''Hara, Jeffrey Jones, and Winona Ryder)."},
{"_id":{"$oid":"61ccb6882b463cd4e2ba5186"},"Title":"Philadephia","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They’re plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters. Films that fall into drama sub-genres include historical drama, romantic drama, teen drama, medical drama, docudrama, and film noir."},"Director":{"Name":"Jonathan Demme","Birth":"1944"},"Featured":true,"MovieDescription":"Philadelphia is a 1993 American legal drama film written by Ron Nyswaner, directed by Jonathan Demme and starring Tom Hanks and Denzel Washington.[2] It is notable for being one of the first mainstream Hollywood films to acknowledge HIV/AIDS."},
{"_id":{"$oid":"61ccb87b2b463cd4e2ba5187"},"Title":"Knocked Up","Genre":{"Name":"Romance","Description":"The term romance has multiple meanings; for example, historical romances like those of Walter Scott would use the term to mean a fictitious narrative in prose or verse; the interest of which turns upon marvellous and uncommon incidents."},"Director":{"Name":"Judd Apatow","Birth":"1968"},"Featured":true,"MovieDescription":"Knocked Up is a 2007 American romantic comedy film written, co-produced and directed by Judd Apatow, and starring Seth Rogen, Katherine Heigl, Paul Rudd, and Leslie Mann. It follows the repercussions of a drunken one-night stand between a slacker and a recently promoted media personality that results in an unintended pregnancy. The film was released on June 1, 2007, to box office success, grossing $219 million worldwide, and acclaim from critics.","Birth":"1968"},
{"_id":{"$oid":"61ccb8fa2b463cd4e2ba5188"},"Title":"Love","Genre":{"Name":"Romance","Description":"The term romance has multiple meanings; for example, historical romances like those of Walter Scott would use the term to mean a fictitious narrative in prose or verse; the interest of which turns upon marvellous and uncommon incidents."},"Director":{"Name":"Judd Apatow","Birth":"1968"},"Featured":true,"MovieDescription":"Love is an American romantic comedy streaming television series created by Judd Apatow, Lesley Arfin, and Paul Rust. The series stars Rust, Gillian Jacobs, Mike Mitchell, and Claudia O''Doherty. Netflix originally ordered two seasons of the show. The first 10-episode season was made available on February 19, 2016, and a 12-episode second season premiered on March 10, 2017. Netflix renewed the series for a third season one month prior to the second-season premiere. On December 15, 2017, Netflix announced that the third season would be its last. Season 3 premiered on March 9, 2018."},
{"_id":{"$oid":"61ccb9872b463cd4e2ba5189"},"Title":"Superbad","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Birth":"1968"},"Featured":true,"MovieDescription":"Superbad is a 2007 American coming-of-age teen buddy comedy film directed by Greg Mottola and produced by Judd Apatow. The film stars Jonah Hill and Michael Cera as Seth and Evan, two teenagers about to graduate from high school. Before graduating, the boys want to party and lose their virginity, but their plan proves harder than expected. Written by Seth Rogen and Evan Goldberg, the script began development when they were 13 years old, and was loosely based on their experience in Grade 12 at Point Grey Secondary School in Vancouver during the 1990s; the main characters have the same given names as the two writers. Rogen was also initially intended to play Seth, but due to age and physical size this was changed, and Hill went on to portray Seth, while Rogen portrayed the irresponsible Officer Michaels, opposite Saturday Night Live star Bill Hader as Officer Slater."},
{"_id":{"$oid":"61ccb9c02b463cd4e2ba518a"},"Title":"Funny People","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Birth":"1968"},"Featured":true,"MovieDescription":"Funny People is a 2009 American psychological comedy-drama film written and directed by Judd Apatow, co-produced by Apatow Productions and Madison 23 Productions, and starring Adam Sandler, Seth Rogen, Leslie Mann, Eric Bana, Jonah Hill, and Jason Schwartzman. The film follows a famous comedian who is diagnosed with a terminal disease and tries to fix the relationships in his life while befriending an aspiring comedian. The film was released on July 31, 2009. It received praise for the performances but criticism for its runtime, and grossed $71 million against its $75 million budget."},
{"_id":{"$oid":"61ccbb9a2b463cd4e2ba518b"},"Title":"Alice in Wonderland","Genre":{"Name":"Fantasy","Description":"A fantasy story is about magic or supernatural forces."},"Director":{"Name":"Tim Burton","Birth":"1958"},"Featured":true,"MovieDescription":"Alice in Wonderland is a 2010 American dark fantasy film directed by Tim Burton from a screenplay written by Linda Woolverton. The film stars Johnny Depp, Anne Hathaway, Helena Bonham Carter, Crispin Glover, Matt Lucas, and Mia Wasikowska, and features the voices of Alan Rickman, Stephen Fry, Michael Sheen, and Timothy Spall. Inspired by Lewis Carroll''s fantasy novels, Alice''s Adventures in Wonderland and Through the Looking-Glass, and Walt Disney''s 1951 animated film of the same name, Alice in Wonderland is a live-action animated film about nineteen-year-old Alice Kingsleigh, who is told that she can restore the White Queen to her throne, with the help of the Mad Hatter. She is the only one who can slay the Jabberwocky, a dragon-like creature that is controlled by the Red Queen and terrorizes Underland''s inhabitants. In this situation, the Hatter and Alice fights against the Red Queen to protect the world."},
{"_id":{"$oid":"61ccbbd52b463cd4e2ba518c"},"Title":"Charlie and the Chocolate Factory","Genre":{"Name":"Fantasy","Description":"A fantasy story is about magic or supernatural forces."},"Director":{"Name":"Tim Burton","Birth":"1958"},"Featured":true,"MovieDescription":"Charlie and the Chocolate Factory is a 2005 musical fantasy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket, alongside David Kelly, Helena Bonham Carter, Noah Taylor, Missi Pyle, James Fox, Deep Roy, and Christopher Lee. The storyline follows Charlie as he wins a contest along with four other children and is led by Wonka on a tour of his chocolate factory."}
]